{"resourceType":"OperationDefinition","id":"medication-overview","url":"http://nictiz.nl/fhir/OperationDefinition/Medication-Overview","name":"Retrieve Medication Overview","status":"active","kind":"operation","experimental":false,"publisher":"Nictiz","contact":[{"name":"Nictiz","telecom":[{"system":"email","value":"info@nictiz.nl","use":"work"}]}],"description":"The *medication-overview* operation provides a simple method for a client to request a patient's current Medication Overview based on the information standard ['Medication Process'](https://www.nictiz.nl/Paginas/Informatiestandaard-Medicatieproces.aspx).     The response is a Bundle of type 'searchset'. At a minimum, a List resource and Patient resource is returned, along with any other resources that the server has available for the Medication Overview.     The server also returns whatever resources are needed to support the Medication Overview - e.g. linked practitioners, organizations etc.          If there are no medication related clinical resources, this operation SHALL return an empty List resource containing an appropriate value for the .emptyReason element.","purpose":"To describe how to retrieve and provide a medication overview conform the Medication Prosces information standard.      This operation removes the complexity of requesting the medication overview from the client to the server.","code":"medication-overview","comment":"This operation assumes that the server has identified and secured the context appropriately, and can either associate the authorization context with a single patient, or determine whether the context has the rights to the nominated patient, if there is one.","system":true,"type":false,"instance":false,"parameter":[{"name":"patient","use":"in","min":0,"max":"1","documentation":"The id of a patient resource located on the server on which this operation is executed.        This paramater is not be necessary for use in MedMij because all RESTfull actions are perfomed in the context of a specific authenticated patient, for which an OAuth2 token has been retrieved using the authentication mechanisms described in the 'Afsprakenstelsel'.        Each XIS Gateway is required to perform filtering based on the patient associated with the OAuth2 token received for the request, so that only the records associated with the authenticated patient are returned.        Therefore, no parameters should be passed for patient identification.","type":"Identifier"},{"name":"bundle","use":"out","min":1,"max":"1","documentation":"The patient's current medication overview based on the information standard ['Medication Proces'](https://www.nictiz.nl/Paginas/Informatiestandaard-Medicatieproces.aspx).        The Bundle shall be compliant with the Medication-Overview profile.","type":"Bundle","profile":{"reference":"http://nictiz.nl/fhir/StructureDefinition/Bundle-MedicationOverview","display":"Profile on Bundle resource, that defines a medication overview collection."}}]}